Smoking Pipe Tutorial/smoking_pipe_steady_state/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
	type	fixedValue;
	value	uniform (0 -0.01 0);
    }

    Outlet
    {
	type	zeroGradient;
	value	uniform (0 0 0);
    }

    Walls
    {
	type noSlip;
        value uniform (0 0 0);
    }

    PipeHandle
    {
	type noSlip;
        value uniform (0 0 0);
    }
    defaultFaces
    {
	type	slip;
    }
}

// ************************************************************************* //
