Smoking Pipe Tutorial/smoking_pipe_steady_state/0_orig/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    defaultFaces
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    PipeHandle
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
4683
(
1
1
1
1
1
1
1
1
...
)
;
    }
    Walls
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
19345
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
